dafoam_pytorch_hfdib_demo/datasets/four_port_64/topology_456/case/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 1;
method          scotch;
